In [1]:
import pandas as pd
import numpy as np

In [3]:
pd.Series([300,400,500], index=["jan", "feb", "march"])

jan      300
feb      400
march    500
dtype: int64

In [4]:
dict1={"jan": 300, "feb": 400, "march":500}

In [6]:
var_series=pd.Series(dict1)
var_series

jan      300
feb      400
march    500
dtype: int64

In [7]:
var_series["feb"]

np.int64(400)

In [8]:
"jan" in var_series

True

In [9]:
sales = pd.Series([65,69,72,81,60,2,56,9,27,73,84,5])
sales

0     65
1     69
2     72
3     81
4     60
5      2
6     56
7      9
8     27
9     73
10    84
11     5
dtype: int64

In [11]:
sales.head()

0    65
1    69
2    72
3    81
4    60
dtype: int64

In [12]:
sales.tail()

7      9
8     27
9     73
10    84
11     5
dtype: int64

In [13]:
sales.min()

2

In [14]:
sales.max()

84

In [15]:
sales.sum()

np.int64(603)

In [16]:
sales.mean()

np.float64(50.25)

In [17]:
sales.std() # Standard devation

30.733827972092605

In [18]:
sales.var() # Variance

944.5681818181819

In [19]:
sales.unique()

array([65, 69, 72, 81, 60,  2, 56,  9, 27, 73, 84,  5])

In [21]:
# DataFrames
# From dictionary (most common)
data = {'Name': ['Alice', 'Bob', 'Charlie'], 
        'Age': [25, 30, 35], 
        'City': ['NYC', 'LA', 'Chicago']}
df = pd.DataFrame(data)
print(df)

      Name  Age     City
0    Alice   25      NYC
1      Bob   30       LA
2  Charlie   35  Chicago

In [22]:
# Shape and info
print(df.shape)  # (rows, columns)
df.info()        # Data types, memory usage

# Select columns
print(df['Name'])

# Filter rows
young = df[df['Age'] < 30]
print(young)

# Add column
df['Salary'] = [50000, 60000, 70000]

(3, 3)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes
0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object
    Name  Age City
0  Alice   25  NYC

In [23]:
# Group by city and mean age
grouped = df.groupby('City')['Age'].mean()
print(grouped)

# Describe stats
print(df.describe())

City
Chicago    35.0
LA         30.0
NYC        25.0
Name: Age, dtype: float64
        Age   Salary
count   3.0      3.0
mean   30.0  60000.0
std     5.0  10000.0
min    25.0  50000.0
25%    27.5  55000.0
50%    30.0  60000.0
75%    32.5  65000.0
max    35.0  70000.0

In [25]:
data = np.random.randint(0,10,(3,3))
data

array([[2, 1, 7],
       [6, 6, 2],
       [9, 0, 1]])

In [26]:
pd.DataFrame(data)

   0  1  2
0  2  1  7
1  6  6  2
2  9  0  1